# PtPerpLine

## Description
Returns a point on the input line which is closest to the input point. Doesn't check to see that the point is ON the line.

```pascal
FUNCTION PtPerpLine(
				pt    : VECTOR;
				begPt : VECTOR;
				endPt : VECTOR) : VECTOR;
```

```python

def vs.PtPerpLine(pt, begPt, endPt):
    return VECTOR
```

## Parameters
|Name|Type|Description|
|---|---|---|
|pt|VECTOR||
|begPt|VECTOR||
|endPt|VECTOR||

## Version
Availability: from Vectorworks 2014
## Category
* Graphic Calculation